
# YOLO11s with P2 head (stride 4) — aerial small-object modification
# Persons at 15-25px are detectable at stride 4 but not stride 8.
# Block change vs YOLOv8: C2f → C3k2 (YOLO11 native block with better gradient flow)

nc: 80
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]
  - [-1, 1, Conv,   [128, 3, 2]]
  - [-1, 2, C3k2,   [256, False, 0.25]]
  - [-1, 1, Conv,   [256, 3, 2]]
  - [-1, 2, C3k2,   [512, False, 0.25]]
  - [-1, 1, Conv,   [512, 3, 2]]
  - [-1, 2, C3k2,   [512, True]]
  - [-1, 1, Conv,   [1024, 3, 2]]
  - [-1, 2, C3k2,   [1024, True]]
  - [-1, 1, SPPF,   [1024, 5]]
  - [-1, 2, C2PSA,  [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]    # P3 neck

  # P2 head addition — aerial modification
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]      # concat backbone P2 features
  - [-1, 2, C3k2, [128, False]]    # P2 neck (stride 4)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  # Detect at P2(stride4), P3(stride8), P4(stride16), P5(stride32)
  - [[18, 21, 24, 27], 1, Detect, [nc]]
